; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v13 ?v11)
             (pred_9 ?v9 ?v1)
             (pred_6 ?v13 ?v1)
             (pred_1 ?v7 ?v13 )
	     (pred_8 ?v13)
             (pred_4 ?v4)
             (pred_10 ?v9)
             (pred_7 ?v1)
             (pred_3 ?v13)
             (pred_11 ?v9)
             (pred_2 ?v13)
             (pred_5 ))



(:action op_4
:parameters (?v8 ?v5 ?v10 ?v2)
:precondition (and (pred_4 ?v8) (pred_4 ?v5) (pred_10 ?v10) (pred_7 ?v2)
          (pred_12 ?v8 ?v5) (pred_9 ?v10 ?v2)
                   (pred_6 ?v5 ?v2) (pred_8 ?v8) 
                   (pred_3 ?v5) (pred_11 ?v10))
:effect (and  (pred_2 ?v5) (not (pred_3 ?v5))))


(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_4 ?v8) (pred_4 ?v12)
               (pred_8 ?v8) (pred_12 ?v8 ?v12) (pred_2 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v8))))

(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_4 ?v8) (pred_10 ?v10) 
                  (pred_8 ?v8) (pred_1 ?v10 ?v8) (pred_5 ))
:effect (and (pred_11 ?v10)
   (not (pred_1 ?v10 ?v8)) (not (pred_5 ))))


(:action op_2
:parameters (?v8 ?v3 ?v6)
:precondition (and (pred_4 ?v8) (pred_10 ?v3) (pred_10 ?v6)
                  (pred_8 ?v8) (pred_11 ?v6) (pred_1 ?v3 ?v8))
:effect (and (pred_11 ?v3) (pred_1 ?v6 ?v8)
        (not (pred_11 ?v6)) (not (pred_1 ?v3 ?v8))))

(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_4 ?v8) (pred_10 ?v10) 
                  (pred_8 ?v8) (pred_11 ?v10))
:effect (and (pred_5 ) (pred_1 ?v10 ?v8) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_02 obj_19 obj_01 obj_20 obj_11 obj_07 obj_14 obj_13 obj_17 obj_18 obj_08 obj_06 obj_12 obj_09 obj_16
    obj_10 obj_04
    obj_03 obj_05
    )

    (:init
       (pred_5)

       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_4 obj_20)
       (pred_4 obj_11)
       (pred_4 obj_07)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_05)

       (pred_12 obj_15 obj_20)
       (pred_12 obj_15 obj_02)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_19)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_02)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_11 obj_07)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_11)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_13 obj_17)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_17 obj_13)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_08 obj_16)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_09 obj_16)
       (pred_12 obj_09 obj_18)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_16 obj_08)
       (pred_12 obj_16 obj_09)
       (pred_3 obj_02)
       (pred_3 obj_16)
       (pred_6  obj_02 obj_10)
       (pred_6  obj_16 obj_04)
       (pred_2 obj_15)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_20)
       (pred_2 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_17)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_09)

       (pred_9  obj_03 obj_10)
       (pred_9  obj_05 obj_04)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_05 obj_06)
       (pred_8 obj_18)
    )

    (:goal (and
       (pred_1 obj_05 obj_17)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_1 obj_18 obj_17)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_17)
   goals met: 0 of 1
2. (op_1 obj_17 obj_12)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_12)
   goals met: 0 of 1
3. (op_1 obj_12 obj_06)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_05)
   deleted: (pred_1 obj_05 obj_06) (pred_5)
   added: (pred_11 obj_05)
   goals met: 0 of 1
5. (op_1 obj_06 obj_12)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_12)
   goals met: 0 of 1
6. (op_1 obj_12 obj_17)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_17)
   goals met: 0 of 1
7. (op_5 obj_17 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_5) (pred_1 obj_05 obj_17)
   goals met: 1 of 1
